<template>
  <section class="text-center container section-margin">
    <h3 class="text-h3 text-left q-mb-xl">Часто задаваемые вопросы</h3>
    <c-faq-list :questions="questionList" class="q-pb-xl" />
  </section>
</template>
<script setup>
import CFaqList from "./ClubFAQList.vue";
import { ref } from "vue";

const questionList = ref([
  {
    id: 1,
    label: "Какие требования к участникам 1Т Клуба?",
    content: [
      "Если вы старше 16 лет и имеете желание реализовать себя в IT-сфере, присоединяйтесь к 1Т Клубу. ",
    ],
  },
  {
    id: 2,
    label: "Что внутри 1Т Клуба? Какие задачи я смогу решать?",
    content: [
      "Да, вы можете принять участие в 1T Клубе, даже если вы только начинаете свой бизнес. 1T Клуб — это сообщество предпринимателей, новаторов и владельцев бизнеса, которые стремятся к успеху в своих областях.",
    ],
  },
  {
    id: 3,
    label: "Как вступить в команду 1Т Клуба?",
    content: [
      "Для вступления в команду 1Т Клуба вам необходимо: <br> <br> 1. Пройти регистрацию на платформе <br> 2. В разделе «Команды» выбрать и подать заявку на вступление",
    ],
  },
  {
    id: 4,
    label: "Как оформить заказ в 1Т Клубе?",
    content: [
      "Для этого вам необходимо: <br> <br> 1. Пройти регистрацию на платформе <br>  2. Подать заявку для участие в интересующем мероприятии",
    ],
  },
]);
</script>
<style scoped lang="scss"></style>
