<template>
  <section class="text-center container">
    <h3 class="text-h3 text-left title">Часто задаваемые вопросы</h3>
    <c-faq-list :questions="questionList" />
  </section>
</template>
<script setup>
import CFaqList from "./ClubFAQList.vue";
import { ref } from "vue";

const questionList = ref([
  {
    id: 1,
    label: "Какие бизнес-задачи поможет решить 1Т клуб?",
    content: [
      "Подбор IT-специалистов и укомплектованных IT-команд",
      "Обмен знаниями и опытом с резидентами 1Т Клуба",
      "Углубление социальных связей через общение на онлайн и офлайн мероприятиях",
      "Поддержка и консультация от экспертов в IT сфере",
    ],
  },
  {
    id: 2,
    label:
      "Могу ли я принять участие в 1Т Клубе, если еще не предприниматель, а только начинаю свое дело?",
    content: [
      "Да, вы можете принять участие в 1T Клубе, даже если вы только начинаете свой бизнес. 1T Клуб — это сообщество предпринимателей, новаторов и владельцев бизнеса, которые стремятся к успеху в своих областях.",
    ],
  },
  {
    id: 3,
    label: "Что будет, если команды 1Т Клуба не справятся с проектом?",
    content: [
      "В случае возникновения недопонимания или неудовлетворенности качеством IT-продукта заказчиком подключается платформа 1Т Клуба для урегулирования споров. Решением может стать возврат денег за услугу (частичный или полный) либо гарантия выполнения услуги экспертами 1Т клуба.",
    ],
  },
  {
    id: 4,
    label: "Какие требования к резидентам 1Т Клуба?",
    content: [
      "Вы можете вступить в 1Т Клуб, если вы владелец бизнеса или фаундер (основатель) IT-стартапа, технологической компании или социально значимого проекта.",
    ],
  },
]);
</script>
<style scoped lang="scss">
.title {
  margin-bottom: 50px;
}
.container {
  margin-bottom: 160px;
}
</style>
